#Задача 3. Найти расстояние между двумя точками пространства

x_1 = int(input("Введите координаты x1:"))
y_1 = int(input("Введите координаты y1:"))
z_1 = int(input("Введите координаты z1:"))

x_2 = int(input("Введите координату x2:"))
y_2 = int(input("Введите координату y2:"))
z_2 = int(input("Введите координату z2:"))

distance = format(((x_2 - x_1)**2 + (y_2 - y_1)**2 + (z_2 - z_1)**2)**0.5, '.2f')
print(f'Расстояние между точками равно {distance}')



